{"pages":[{"title":"MONTRÉAL.AI | Montréal Artificial Intelligence","text":"Montréal.AI Consulting “ We want to see more widespread matrix interoperability, individual and life-long learning opportunities and development of Chief AI Officers who possess the knowledges, the skills and the competencies to orchestrate impactful breakthroughs and tangible economic growth for Fortune 500, governments and interagency partners in full compliance with our masterplan : The Montréal AI-First Conglomerate Overarching Program.“ Montréal.AI : The Best in AI ConsultingMONTRÉAL.AI | Montréal Artificial Intelligence develops and trains completion-oriented women and men with the determination to ensure a fully ‘Joint Artificial Intelligence Consulting Workforce’ : Intellectually, operationally, organizationally, and technically. Today, Montréal.AI Consulting offers hugely impactful artificial intelligence that has the potential to advance humanity more significantly than the agricultural revolution. Montréal.AI Space | Consulting “Recognizing that Montreal is a world-class aerospace industry hub and a world leader in artificial intelligence, we’ve created Montréal.AI Space.“ — Vincent Boucher, Founding Chairman at Montréal.AI Considering that top AI talent is extremely scarce right now and bearing in mind that consulting the right AI leader can significantly increase your odds of business success, Montréal.AI Space now offers consulting. Montréal.AI Blockchain | Consulting“…there is no discrimination against robots or humans in the Ethereum ecosystem…“ — Ethereum Foundation Apply AI In Ways Never Thought Of Deploying powerful AI agents on Blockchain ; Developing general-purpose multi-agent DAE ; Evolving Blockchain-based artificial life ; etc. Montréal.AI DAO : A modality agnostic platform for developing general-purpose AI-first decentralized autonomous organisations (Startups, Government, Institutes, …) + A toolkit to deploy AI on top of it. AI + Ethereum = Artificial Life (The Economy of Things) “You never change things by fighting the existing reality. To change something, build a new model that makes the existing model obsolete.“ — Buckminster Fuller Montréal.AI Atelier | Top AI ModelsThe Montréal.AI Atelier develops scorching top AI models in the browser from transfer learning combined with reinforcement learning (RL) and good old fashioned machine learning intuition. The Montréal.AI Atelier in addition deploys tailored top AI models and fully-fledged AI systems. Montréal.AI SafetyMitigation, Safeguarding and Sustainability If an autonomous agent becomes self-aware, clients can reach the Montréal.AI Safety Red Phone directly. “We expect AI technologies to be hugely impactful in the short term, but their impact will be outstripped by that of the first AGIs.“ — OpenAI Join Us — A Once-in-a-Lifetime OpportunityMONTRÉAL.AI | Montréal Artificial Intelligence is starting an effort to bring together the top world-class deep learning experts, captains of industries and leading seasoned executives to build a decisive, preeminent and renowned outstanding AI consulting workforce. To apply to join our pool of outstanding consulting workforce : rh@montreal.ai References“Last year, the cost of a top, world-class deep learning expert was about the same as a top NFL quarterback prospect. The cost of that talent is pretty remarkable.“ — Peter Lee, Microsoft Million-dollar babies — The Economist The Battle for Top AI Talent Only Gets Tougher From Here — Wired The Tech Oligopoly — Part 1 | The New Kingmakers — Arif Khan Oracle recently offered an artificial intelligent expert as much as $6 million in total pay as Silicon Valley’s talent war heats up — The Economist A.I. Researchers Are Making More Than $1 Million, Even at a Nonprofit — The New York Times “Breakthrough in machine learning would be worth 10 Microsofts.“ — Bill Gates Chief AI Officers : C-level AI | Executive Education‎Built on over $1 Million ($1,000,000) in artificial intelligence research Chief AI Officers : C-level AI harnesses the fundamentals of artificial intelligence on a truly global scale and put them to strategically leverage enterprises, governments and institutions with precision engineering. “In a moment of technological disruption, leadership matters.“ — Andrew Ng Success is about actively shaping the game that matters to you. This well-crafted C-level professional keynote pioneers a highly impactful understanding of transformative artificial intelligence strategies, at boardroom level, bringing to life new perspectives for state, national, and international organizations. Participant Profile“We want to see more life-long learning opportunities, across the board matrix interoperability and the development of Chief AI Officers who possess the knowledges, the skills and the competencies to orchestrate impactful breakthroughs and tangible economic growth for Fortune 500, governments and interagency partners in full compliance with our masterplan : The Montréal AI-First Conglomerate Overarching Program.“ — Vincent Boucher, B. Sc. Physics, M. A. Policy Analysis and M. Sc. Aerospace Engineering (Space Technology), Founding Chairman at Montréal.AI Chief AI Officers : C-level AI is designed for the : Board Members; Captains of Industry; Chancellors; Chief Executive Officers; Commanders; Excellences; Global Chairs High-Potential Executives; Iconic Tech Entrepreneurs; Luminaries; Managing Directors; Moguls; Philanthropists; Presidents; Scholars; Successful Entrepreneurs and Financiers; and Visionary Founders … who wish to strategically unleash the power of artificial intelligence on a truly global scale. Powered by Eventbrite “It’s springtime for AI, and we’re anticipating a long summer.“ — Bill Braun, CIO of Chevron ✉️ Email Us : info@montreal.ai📞 Phone : +1.514.829.8269🌐 Website : http://www.montreal.ai📝 LinkedIn : https://www.linkedin.com/in/montrealai🏛 Headquarters : 350, PRINCE-ARTHUR STREET W., SUITE #2105, MONTREAL [QC], CANADA, H2X 3R4 *Administrative Head Office #AIFirst #Chief AI Officers #MontrealAI #MontrealArtificialIntelligence","link":"/MontrealAI.github.io/consulting/index.html"},{"title":"Montréal Artificial Intelligence","text":"AVIS LÉGAL - LEGAL NOTICE​​MATERIALS PROVIDED IN THIS SYSTEM ARE PROVIDED WITHOUT WARRANTY OF ANY KIND AND DOES NOT CONSTITUTE ENDORSEMENT. | LES INFORMATIONS DONNÉES PAR CE SYSTÈME SONT FOURNIES SANS GARANTIE D’AUCUNE SORTE ET NE CONSTITUENT PAS UNE APPROBATION.​​✉️ Email Us : info@montreal.ai​🌐 Website : http://www.montreal.ai/​​#AI #AIFirst #MontrealAI #MontrealArtificialIntelligence","link":"/MontrealAI.github.io/legal/index copy.html"},{"title":"Montréal Artificial Intelligence","text":"AVIS LÉGAL - LEGAL NOTICETHIS IS A MONTREAL.AI SOFTWARE / SYSTEM. MATERIALS PROVIDED IN THIS SOFTWARE / SYSTEM ARE PROVIDED WITHOUT WARRANTY OF ANY KIND AND DOES NOT CONSTITUTE ENDORSEMENT. THIS SOFTWARE / SYSTEM IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL MONTREAL.AI, THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THIS SOFTWARE / SYSTEM OR THE USE OR OTHER DEALINGS IN THIS SOFTWARE / SYSTEM. EVIDENCE OF UNAUTHORIZED USE MAY BE PROVIDED TO APPROPRIATE PERSONNEL FOR ADMINISTRATIVE, CRIMINAL OR OTHER LEGAL ACTION.​​​​​ ​✉️ Email Us : info@montreal.ai​📞 Phone : +1.514.829.8269​🌐 Website : http://www.montreal.ai​📝 LinkedIn : https://www.linkedin.com/in/montrealai​🏛 Headquarters : 350, PRINCE-ARTHUR STREET W., SUITE #2105, MONTREAL [QC], CANADA, H2X 3R4 *Administrative Head Office​​#AIFirst #MontrealAI #MontrealArtificialIntelligence","link":"/MontrealAI.github.io/legal/index.html"},{"title":"Montréal Artificial Intelligence","text":"Montréal.AI Web — The Dawn of Artificial IntelligenceArtificial Intelligence for the Web : Converting AI Research into Commercial Successes. At the forefront of AI, deploying superhuman agents that can learn from experience in the browser unlocks new powerful possibilities to apply AI in ways we never thought of! E.g., on a mobile device, the autonomous agent can leverage sensor data (i.e.: gyroscope or accelerometer) and take actions. True understanding comes from agents that learn by “seeing” how they affect the world. All data stays on the client, making AI agents in the browser useful for privacy preserving applications. “ Artificial Intelligence is about recognising patterns, Artificial Life is about creating patterns. “ — Mizuki Oka et al, #alife2018 A Proof of Concept : Getting Alexa to Respond to Sign LanguageUsing TensorFlow to make an Amazon Echo respond to sign language, by M. A. Singh : Blog Post by by M. A. Singh Code for the Proof of Concept on GitHub Advanced and Impactful Open-Source TechnologiesBringing contributions by scholars recognized as the foremost authorities in their fields, Montréal Artificial Intelligence is ahead of trends that will profoundly influence the future of Humanity. Cutting edge open-source technologies proudly used : 1. TensorFlow.jsTraining and Deploying ML Models in the Browser TensorFlow.js uses flexible and intuitive APIs to build and train models from scratch using a low-level JavaScript linear algebra library or a high-level layers API. The TensorFlow.js model converters allows running pre-existing TensorFlow models right in the browser or under Node.js. Pre-existing ML models can be retrained using sensor data connected to the browser, or other client-side data. Three development workflows : Importing an existing, pre-trained model for inference ; Re-training an imported model quickly (transfer learning) with only a small amount of data ; and Authoring (define, train, and run) models directly in the browser. TensorFlow.js AI agents can be trained using reinforcement learning, neuroevolution, or other machine learning methods. There’s no need to install anything. Just open a webpage, and your AI Agent is ready to run. References : TensorFlow.js TensorFlow dev summit Official TensorFlow.js Launch Introducing TensorFlow.js by Josh Gordon and Sara Robinson Deep Learning in JS - Ashi Krishnan - JSConf EU 2018 TensorFlow.js Gallery 2. Reinforcement LearningGoing Beyond Input-Output Pattern Recognition In the past few years deep reinforcement learning started achieving state-of-the-art results. “ Reinforcement learning (RL) is the subfield of machine learning concerned with decision making and motor control. It studies how an agent can learn how to achieve goals in a complex, uncertain environment. “ — OpenAI At the bleeding edge of AI, autonomous agents can learn from experience, simulate worlds and orchestrate meta-solutions. Here’s an inspiring example of a high-quality implementation of a reinforcement learning algorithm : Powerful and useful application domains : Dialogue, Healthcare, Management, Robotics, Smart Grid, Supply Chains, etc. “ Self-Play is Automated Knowledge Creation. “ — Carlos E. Perez References : OpenAI Gym by OpenAI OpenAI Baselines by OpenAI AlphaGo Zero: Learning from scratch by DeepMind A Visual Guide to Evolution Strategies by David Ha OpenAI Five by OpenAI 3. TensorFlow HubReusing Machine Learning Modules TensorFlow Hub is a library for the publication, discovery, and consumption of reusable parts of machine learning models. A module is a self-contained piece of a TensorFlow graph, along with its weights and assets, that can be reused across different tasks in a process known as transfer learning. Transfer learning can: Train a model with a smaller dataset ; Improve generalization: and Speed up training. “ I think transfer learning is the key to general intelligence. And I think the key to doing transfer learning will be the acquisition of conceptual knowledge that is abstracted away from perceptual details of where you learned it from. “ — Demis Hassabis TensorFlow Hub Introducing TensorFlow Hub by Josh Gordon Transform your Web Site with an AI AgentFully-fledged AI systems can achieve serious revenue! Montréal Artificial Intelligence helps to transform Web sites for the age of artificial intelligence by developing machine learning agents in the browser that achieves goal-oriented behavior. Demos : Solving the cart-pole control problem in the browser using the policy-gradient method Live demo : https://storage.googleapis.com/tfjs-examples/cart-pole/dist/index.html Code : https://github.com/tensorflow/tfjs-examples/tree/master/cart-pole Predicting balls and strikes using TensorFlow.js Blog : https://medium.com/tensorflow/predicting-balls-and-strikes-using-tensorflow-js-2acf1d7a447c Animation with CPPNs and TensorFlow.js, an @observablehq notebook by Emily Reif @observablehq notebook by Emily Reif : https://beta.observablehq.com/@emilyreif/animation-with-cppns Move Mirror: An AI Experiment with Pose Estimation in the Browser using TensorFlow.js By Jane Friedhoff and Irene Alvarado : https://medium.com/tensorflow/move-mirror-an-ai-experiment-with-pose-estimation-in-the-browser-using-tensorflow-js-2f7b769f9b23 L1: Tensor Studio — An in-browser live-programming environment by Milan Lajtoš Live demo : https://mlajtos.github.io/L1/latest/ Github : https://github.com/mlajtos/L1 References : Unity ML-Agents Toolkit by Unity A Brief Survey of Deep Reinforcement Learning Arulkumaran et al. “ Nothing is more powerful than an idea whose time has come. “ — Victor Hugo Montréal.AI is offering a new world age of impactful technical prowesses on an unprecedented scale. To order your AI Agent :✉️ Email Us : info@montreal.ai📞 Phone : +1.514.829.8269🌐 Website : http://www.montreal.ai/📝 LinkedIn : https://www.linkedin.com/in/montrealai/🏛 Headquarters : 350, PRINCE-ARTHUR STREET W., SUITE #2105, MONTREAL [QC], CANADA, H2X 3R4 *Administrative Head Office #AIFirst #MontrealAI #MontrealArtificialIntelligence","link":"/MontrealAI.github.io/web-ai/index.html"},{"title":"MONTRÉAL.AI | Montréal Artificial Intelligence","text":"Montréal.AI AcademyAI 101 : Montréal.AI is the largest artificial intelligence community in Canada. Join us and learn at https://www.facebook.com/groups/MontrealAI/ ! The First World-Class Overview of AI for the General PublicCurated Open-Source Codes, Implementations and Science “The best way to predict the future is to invent it.“ — Alan Kay 0. Getting StartedToday’s artificial intelligence is powerful, useful and accessible to all. Tinker with Neural Networks : Neural Network Playground — TensorFlow On a Local MachineInstall Anaconda and Launch ‘Anaconda Navigator’Update Jupyterlab and Launch the Application Under Notebook, Click on ‘Python 3’ JupyterLab is Ready for Users — Project Jupyter In the Cloud Colab: An easy way to learn and use TensorFlow — TensorFlow Access free GPU compute via Colab — TensorFlow Open in Colab — Open a Github-hosted notebook in Google Colab — colab-team TensorFlow Blog — TensorFlow In the Browser TensorFlow dev summit Official TensorFlow.js Launch Introducing TensorFlow.js: Machine Learning in Javascript — Josh Gordon, Sara Robinson TensorFlow.js — TensorFlow Preliminary Readings Deep Learning — Yann LeCun, Yoshua Bengio, Geoffrey Hinton The WIRED Guide to artificial intelligence — WIRED How to teach yourself hard things — Julia Evans Learn X in Y minutes (Where X=python3) — Louie Dinh The Matrix Calculus You Need For Deep Learning — Terence Parr, Jeremy Howard Introduction to the math of backprop — Deb Panigrahi Introduction to Applied Linear Algebra – Vectors, Matrices, and Least Squares — Stephen Boyd and Lieven Vandenberghe, Cambridge University Press “A birds-eye view of optimization algorithms” — Fabian Pedregosa How to visualize decision trees — Terence Parr, Prince Grover Machine Learning for Visualization — Ian Johnson Scipy Lecture Notes — Scipy Interview with The Youngest Kaggle Grandmaster: Mikel Bober-Irizar (anokas) — Sanyam Bhutani, Hacker Noon Competitive Programmer’s Handbook — Antti Laaksonen Rules of Machine Learning: Best Practices for ML Engineering — Martin Zinkevich A Neural Network in 11 lines of Python — iamtrask Bias-Variance Decomposition — Sebastian Raschka Introduction to Artificial Intelligence, ULiège, Fall 2018. — Gilles Louppe Machine Learning From Scratch — Erik Linder-Norén A Beginner’s Guide to the Mathematics of Neural Networks — A.C.C. Coolen 1. Deep Learning “DL is essentially a new style of programming–”differentiable programming”–and the field is trying to work out the reusable constructs in this style. We have some: convolution, pooling, LSTM, GAN, VAE, memory units, routing units, etc.“ — Thomas G. Dietterich 1.1 Neural Networks “Neural networks” are a sad misnomer. They’re neither neural nor even networks. They’re chains of differentiable, parameterized geometric functions, trained with gradient descent (with gradients obtained via the chain rule). A small set of highschool-level ideas put together.“ — François Chollet AI Playbook — Andreessen Horowitz Clear Explanations of Machine Learning — Distill Deep Learning Book — Ian Goodfellow, Yoshua Bengio, Aaron Courville Neural Networks and Deep Learning — Michael Nielsen Deep Learning — Vincent Vanhoucke | Google TensorSpace: Neural network 3D visualization framework —TensorSpace A Complete Implementation of a Toy Neural Network — Stanford CS class CS231n Neural networks: training with backpropagation — Jeremy Jordan Introduction to Machine Learning for Coders — Jeremy Howard Machine Learning Yearning — Andrew Ng Effective TensorFlow for Non-Experts — Google Developers A curated collection of inspirational AI-powered JavaScript apps — Elle Haproff, Asim Hussain, Osama Jandali Pytorch Implementation of Neural Processes — Chris Ormandy A Few Unusual Autoencoders — Colin Raffel Pytorch implementation of JointVAE, a framework for disentangling continuous and discrete factors of variation — Schlumberger Software Technology A New TensorFlow Hub Web Experience — André Susano Pinto, Clemens Mewald Approximate Fisher Information Matrix to Characterise the Training of Deep Neural Networks — Zhibin Liao, Tom Drummond, Ian Reid, Gustavo Carneiro Building Web App for Computer Vision Model &amp; Deploying to Production in 10 Minutes*: A Detailed Guide — Pankaj Mathur Measuring the Effects of Data Parallelism on Neural Network Training — Christopher J. Shallue, Jaehoon Lee, Joe Antognini, Jascha Sohl-Dickstein, Roy Frostig, George E. Dahl Avito Demand Prediction Challenge : Kaggle winner explains how to combine categorical, numerical, image and text features into a single NN that gets you into top 10 without stacking — Little Boat fast.ai | Making neural nets uncool again Intro Machine Learning | Practical Deep Learning | Cutting Edge Deep Learning | Computational Linear Algebra — Jeremy Howard, Rachel Thomas | Fast.AI “I feel like a significant percentage of Deep Learning breakthroughs ask the question “how can I reuse weights in multiple places?”– Recurrent (LSTM) layers reuse for multiple timesteps– Convolutional layers reuse in multiple locations.– Capsules reuse across orientation.“ — Trask 1.2 Recurrent Neural Networks Understanding LSTM Networks — Christopher Olah Attention and Augmented RNN — Olah &amp; Carter, 2016 Computer, respond to this email — Post by Greg Corrado Reversible Recurrent Neural Networks — Matthew MacKay, Paul Vicol, Jimmy Ba, Roger Grosse Massive Exploration of Neural Machine Translation Architectures arXiv | Docs | Code — Denny Britz, Anna Goldie, Minh-Thang Luong, Quoc Le A TensorFlow implementation of : “Hybrid computing using a neural network with dynamic external memory” GitHub — Alex Graves, Greg Wayne, Malcolm Reynolds, Tim Harley, Ivo Danihelka, Agnieszka Grabska-Barwińska, Sergio Gómez Colmenarejo, Edward Grefenstette, Tiago Ramalho, John Agapiou, Adrià Puigdomènech Badia, Karl Moritz Hermann, Yori Zwols, Georg Ostrovski, Adam Cain, Helen King, Christopher Summerfield, Phil Blunsom, Koray Kavukcuoglu &amp; Demis Hassabis 1.3 Convolution Neural Network “I admire the elegance of your method of computation; it must be nice to ride through these fields upon the horse of true mathematics while the like of us have to make our way laboriously on foot.“ — A. Einstein CNN Is All You Need — Qiming Chen, Ren Wu Feature Visualization — Chris Olah, Alexander Mordvintsev, Ludwig Schubert Understanding Neural Networks Through Deep Visualization — Jason Yosinski, Jeff Clune, Anh Nguyen, Thomas Fuchs, and Hod Lipson MedicalTorch — Christian S. Perone Deep Learning for Generic Object Detection: A Survey — Li Liu, Wanli Ouyang, Xiaogang Wang, Paul Fieguth, Jie Chen, Xinwang Liu, Matti Pietikäinen The Building Blocks of Interpretability — Chris Olah, Arvind Satyanarayan, Ian Johnson, Shan Carter, Ludwig Schubert, Katherine Ye, Alexander Mordvintsev Detectron : State-of-the-art Object Detection — Ross Girshick and Ilija Radosavovic and Georgia Gkioxari and Piotr Doll\\’{a}r and Kaiming He YOLOv3: An Incremental Improvement | WebSite | YouTube — Joseph Redmon, Ali Farhadi AdVis.js : Exploring Fast Gradient Sign Method — Jason Lin, Dilara Soylu Machine Learning for Artists | This is how convolution works — Machine Learning for Artists Deep Painterly Harmonization | Notebook — Sylvain Gugger How Convolutional Neural Networks Work — Brandon Rohrer 1.4 Capsules Dynamic Routing Between Capsules — Sara Sabour, Nicholas Frosst, Geoffrey E Hinton Capsule Networks (CapsNets) – Tutorial — Aurélien Géron Understanding Hinton’s Capsule Networks. Part I: Intuition. — Max Pechyonkin Capsules for Object Segmentation — Rodney LaLonde, Ulas Bagci Brain Tumor Type Classification via Capsule Networks — Parnian Afshar, Arash Mohammadi, Konstantinos N. Plataniotis A Tensorflow implementation of CapsNet — Huadong Liao 2. Autonomous Agents “No superintelligent AI is going to bother with a task that is harder than hacking its reward function.“ — The Lebowski theorem 2.1 Evolution Strategies A Visual Guide to Evolution Strategies — David Ha Evolution Strategies as a Scalable Alternative to Reinforcement Learning — OpenAI The Surprising Creativity of Digital Evolution: A Collection of Anecdotes from the Evolutionary Computation and Artificial Life Research Communities — Joel Lehman, Jeff Clune, Dusan Misevic, Christoph Adami, Lee Altenberg, Julie Beaulieu, Peter J. Bentley, Samuel Bernard, Guillaume Beslon, David M. Bryson, Patryk Chrabaszcz, Nick Cheney, Antoine Cully, Stephane Doncieux, Fred C. Dyer, Kai Olav Ellefsen, Robert Feldt, Stephan Fischer, Stephanie Forrest, Antoine Frénoy, Christian Gagné, Leni Le Goff, Laura M. Grabowski, Babak Hodjat, Frank Hutter, Laurent Keller, Carole Knibbe, Peter Krcah, Richard E. Lenski, Hod Lipson, Robert MacCurdy, Carlos Maestre, Risto Miikkulainen, Sara Mitri, David E. Moriarty, Jean-Baptiste Mouret, Anh Nguyen, Charles Ofria, Marc Parizeau, David Parsons, Robert T. Pennock, William F. Punch, Thomas S. Ray, Marc Schoenauer, Eric Shulte, Karl Sims, Kenneth O. Stanley, François Taddei, Danesh Tarapore, et al. (4 additional authors not shown) Evolved Policy Gradients — Rein Houthooft, Richard Y. Chen, Phillip Isola, Bradly C. Stadie, Filip Wolski, Jonathan Ho, Pieter Abbeel Using Evolutionary AutoML to Discover Neural Network Architectures — Google AI 2.2 Deep Reinforcement Learning Reinforcement Learning: An Introduction — Andrew Barto and Richard S. Sutton Spinning Up as a Deep RL Researcher — Joshua Achiam Intuitive RL: Intro to Advantage-Actor-Critic (A2C) — Rudy Gilman Simple Beginner’s guide to Reinforcement Learning &amp; its implementation — Faizan Shaikh Spinning Up in Deep RL — Joshua Achiam Welcome to Spinning Up in Deep RL! — OpenAI A (Long) Peek into Reinforcement Learning — Lilian Weng Monte Carlo Tree Search – beginners guide — Kamil Czarnogórski DQN Adventure: from Zero to State of the Art — higgsfield SURREAL: Open-Source Reinforcement Learning Framework and Robot Manipulation Benchmark — Linxi Fan, Yuke Zhu, Jiren Zhu, Zihua Liu, Anchit Gupta, Joan Creus-Costa, Silvio Savarese, Li Fei-Fei Learning to Act by Predicting the Future — Alexey Dosovitskiy, Vladlen Koltun Reinforcement Learning with Prediction-Based Rewards — Yura Burda, Harri Edwards, OpenAI Exploration by Random Network Distillation Paper | Code — Yuri Burda, Harrison Edwards, Amos Storkey, Oleg Klimov Large-Scale Study of Curiosity-Driven Learning Paper | Code — Yuri Burda, Harri Edwards, Deepak Pathak, Amos Storkey, Trevor Darrell, Alexei A. Efros OpenAI Baselines : A2C | ACER | ACKTR | DDPG | DQN | GAIL | HER | PPO2 | TRPO — OpenAI Stable Baselines is a set of improved implementations of Reinforcement Learning (RL) algorithms based on OpenAI Baselines Docs | Blog | Code — Antonin Raffin TRPO-GAE Blog | arXiv | arXiv — OpenAI A3C arXiv | Medium | Code — OpenAI Deep Reinforcement Learning — Sergey Levine Vel: PyTorch meets baselines — Jerry Actor-Critic Policy Optimization in Partially Observable Multiagent Environments — Sriram Srinivasan, Marc Lanctot, Vinicius Zambaldi, Julien Perolat, Karl Tuyls, Remi Munos, Michael Bowling TensorFlow Reinforcement Learning — DeepMind TensorFlow Agents — TensorFlow Curiosity and Procrastination in Reinforcement Learning — Nikolay Savinov, Timothy Lillicrap Hierarchical Actor-Critic — Andrew Levy, Robert Platt, Kate Saenko Computational Theories of Curiosity-Driven Learning — Pierre-Yves Oudeyer Depth-Limited Solving for Imperfect-Information Games — Noam Brown, Tuomas Sandholm, Brandon Amos Optimizing Expectations: From Deep Reinforcement Learning to Stochastic Computation Graphs — John Schulman Neural Episodic Control — Alexander Pritzel, Benigno Uria, Sriram Srinivasan, Adrià Puigdomènech, Oriol Vinyals, Demis Hassabis, Daan Wierstra, Charles Blundell RLlib: Abstractions for Distributed Reinforcement Learning — Eric Liang, Richard Liaw, Philipp Moritz, Robert Nishihara, Roy Fox, Ken Goldberg, Joseph E. Gonzalez, Michael I. Jordan, Ion Stoica TreeQN and ATreeC: Differentiable Tree-Structured Models for Deep Reinforcement Learning — Gregory Farquhar, Tim Rocktäschel, Maximilian Igl, Shimon Whiteson Q-map: a Convolutional Approach for Goal-Oriented Reinforcement Learning — Fabio Pardo, Vitaly Levdik, Petar Kormushev Learning to Search with MCTSnets — Arthur Guez, Théophane Weber, Ioannis Antonoglou, Karen Simonyan, Oriol Vinyals, Daan Wierstra, Rémi Munos, David Silver Convergence of Value Aggregation for Imitation Learning — Ching-An Cheng, Byron Boots Dopamine : DQN | C51 | Rainbow | Implicit Quantile Network — Marc G. Bellemare, Pablo Samuel Castro, Carles Gelada, Saurabh Kumar, Subhodeep Moitra S-RL Toolbox: Reinforcement Learning (RL) and State Representation Learning (SRL) for Robotics — Antonin RAFFIN Advanced Deep Learning and Reinforcement Learning — DeepMind Researchers Reinforcement Learning for Improving Agent Design arXiv | Blog — David Ha Deep Reinforcement Learning from Human Preferences arXiv | Blog | Code — OpenAI Introduction to Learning to Trade with Reinforcement Learning — Denny Britz Closing the Sim-to-Real Loop: Adapting Simulation Randomization with Real World Experience — Yevgen Chebotar, Ankur Handa, Viktor Makoviychuk, Miles Macklin, Jan Issac, Nathan Ratliff, Dieter Fox Robustness via Retrying: Closed-Loop Robotic Manipulation with Self-Supervised Learning — Frederik Ebert, Sudeep Dasari, Alex X. Lee, Sergey Levine, Chelsea Finn CURIOUS: Intrinsically Motivated Multi-Task, Multi-Goal Reinforcement Learning — Cédric Colas, Olivier Sigaud, Pierre-Yves Oudeyer One-Shot High-Fidelity Imitation: Training Large-Scale Deep Nets with RL — Tom Le Paine, Sergio Gómez Colmenarejo, Ziyu Wang, Scott Reed, Yusuf Aytar, Tobias Pfaff, Matt W. Hoffman, Gabriel Barth-Maron, Serkan Cabi, David Budden, Nando de Freitas Optimizing Agent Behavior over Long Time Scales by Transporting Value — Chia-Chun Hung, Timothy Lillicrap, Josh Abramson, Yan Wu, Mehdi Mirza, Federico Carnevale, Arun Ahuja, Greg Wayne Large-Scale Study of Curiosity-Driven Learning — Yuri Burda, Harri Edwards, Deepak Pathak, Amos Storkey, Trevor Darrell, Alexei A. Efros Learning to Dress: Synthesizing Human Dressing Motion via Deep Reinforcement Learning — Alexander Clegg, Wenhao Yu, Jie Tan, C. Karen Liu, Greg Turk, SIGGRAPH Asia 2018 Automatic Poetry Generation with Mutual Reinforcement Learning — Xiaoyuan Yi, Maosong Sun, Ruoyu Li, Wenhao Li Learning to Communicate with Deep Multi-Agent Reinforcement Learning in PyTorch — Minqi Jiang Learning to Navigate the Web — Anonymous Understanding &amp; Generalizing AlphaGo Zero — Anonymous Deep RL Bootcamp — Pieter Abbeel, Yan (Rocky) Duan, Xi (Peter) Chen, Andrej Karpathy 2.3 Self Play Deep Learning: AlphaGo Zero Explained In One Picture — L.V. How to build your own AlphaZero AI using Python and Keras — David Foster An open-source implementation of the AlphaGoZero algorithm — TensorFlow “Self-Play is Automated Knowledge Creation.“ — Carlos E. Perez 2.4 Multi-Agent Populations Machine Theory of Mind — Rabinowitz et al. A Unified Game-Theoretic Approach to Multiagent Reinforcement Learning — Lanctot et al. Continuous Adaptation via Meta-Learning in Nonstationary and Competitive Environments — Al-Shedivat et al. Autonomous Agents Modelling Other Agents: A Comprehensive Survey and Open Problems — Stefano V. Albrecht, Peter Stone Learning with Opponent-Learning Awareness Paper | Blog — OpenAI GPU-Accelerated Robotic Simulation for Distributed Reinforcement Learning Paper | Blog — Jacky Liang, Viktor Makoviychuk, Ankur Handa, Nuttapong Chentanez, Miles Macklin, Dieter Fox, NVIDIA Multi-Agent Actor-Critic for Mixed Cooperative-Competitive Environments Paper | Blog | Code — OpenAI 2.5 Deep Meta-Learning Learning to Learn Paper | Code — Google DeepMind, University of Oxford, Canadian Institute for Advanced Research Model-Agnostic Meta-Learning for Fast Adaptation of Deep Networks — Chelsea Finn, Pieter Abbeel, Sergey Levine AutoML: Methods, Systems, Challenges — Frank Hutter, Lars Kotthoff, Joaquin Vanschoren Talos: Hyperparameter Scanning and Optimization for Keras — Autonomio Efficient Neural Architecture Search via Parameter Sharing Paper | Code — Hieu Pham, Melody Y. Guan, Barret Zoph, Quoc V. Le, Jeff Dean Meta-Learning Shared Hierarchies Paper | Blog | Code — OpenAI Reptile: A Scalable Meta-Learning Algorithm — Alex Nichol, John Schulman Learning Shared Dynamics with Meta-World Models — Lisheng Wu, Minne Li, Jun Wang NIPS2017 Meta Learning Symposium videos — NIPS 2017 2.6 Generative Adversarial Network Generative Models — OpenAI GAN Lab: Play with Generative Adversarial Networks (GANs) in your browser! — Minsuk Kahng, Nikhil Thorat, Polo Chau, Fernanda Viégas, Martin Wattenberg Generative Adversarial Networks (GANs) in 50 lines of code (PyTorch) — Dev Nag TensorFlow-GAN (TFGAN) — TensorFlow Bayesian GAN arXiv | GitHub — Yunus Saatchi, Andrew Gordon Wilson Generating Memoji from Photos — Pat Niemeyer Recycle-GAN: Unsupervised Video Retargeting Paper | Blog — Aayush Bansal, Shugao Ma, Deva Ramanan, Yaser Sheikh A collection of GANs TensorFlow | PyTorch “What I cannot create, I do not understand.“ — Richard Feynman 2.7 World Models World Models — David Ha, Jürgen Schmidhuber Imagination-Augmented Agents for Deep Reinforcement Learning — Théophane Weber, Sébastien Racanière, David P. Reichert, Lars Buesing, Arthur Guez, Danilo Jimenez Rezende, Adria Puigdomènech Badia, Oriol Vinyals, Nicolas Heess, Yujia Li, Razvan Pascanu, Peter Battaglia, Demis Hassabis, David Silver, Daan Wierstra 3. Environments3.1 OpenAI Gym OpenAI Gym WebSite | Blog | GitHub | White Paper — OpenAI 3.2 Unity ML-Agents Unity ML-Agents WebSite | GitHub | Documentation | Challenge I — Unity Technologies Puppo, The Corgi: Cuteness Overload with the Unity ML-Agents Toolkit — Vincent-Pierre Berges, Leon Chen 3.3 DeepMind Control Suite DeepMind Control Suite Paper | GitHub | Video — DeepMind 3.4 Brigham Young University | Holodeck BYU Holodeck: A high-fidelity simulator for deep reinforcement learning Website | GitHub | Documentation — Brigham Young University 3.5 Facebook’s Horizon Horizon: Facebook’s Open Source Applied Reinforcement Learning Platform Paper | GitHub | Blog — Jason Gauci, Edoardo Conti, Yitao Liang, Kittipat Virochsiri, Yuchen He, Zachary Kaden, Vivek Narayanan, Xiaohui Ye 4. General Readings, Ressources and Tools Building safe artificial intelligence: specification, robustness, and assurance — Pedro A. Ortega, Vishal Maini, and the DeepMind safety team Google Dataset Search Beta — Google Papers with Code — Papers with Code GitXiv | arXiv + CODE — Collaborative Open Computer Science The Vulnerable World Hypothesis — Nick Bostrom Scalable agent alignment via reward modeling Medium | arXiv — Jan Leike, David Krueger, Tom Everitt, Miljan Martic, Vishal Maini, Shane Legg ASILOMAR AI PRINCIPLES — The 2017 Asilomar conference Strategic Implications of Openness in AI Development — Nick Bostrom teleportHQ ThinkToCode ecosystem — teleportHQ Interpretable Machine Learning — Christoph Molnar Building a Winning Self-Driving Car in Six Months — Keenan Burnett, Andreas Schimpe, Sepehr Samavi, Mona Gridseth, Chengzhi Winston Liu, Qiyang Li, Zachary Kroeze, Angela P. Schoellig Une intelligence artificielle bien réelle : les termes de l’IA — Office québécois de la langue française How to deliver on Machine Learning projects — Emmanuel Ameisen The Malicious Use of Artificial Intelligence: Forecasting, Prevention, and Mitigation — Miles Brundage, Shahar Avin, Jack Clark, Helen Toner, Peter Eckersley, Ben Garfinkel, Allan Dafoe, Paul Scharre, Thomas Zeitzoff, Bobby Filar, Hyrum Anderson, Heather Roff, Gregory C. Allen, Jacob Steinhardt, Carrick Flynn, Seán Ó hÉigeartaigh, Simon Beard, Haydn Belfield, Sebastian Farquhar, Clare Lyle, Rebecca Crootof, Owain Evans, Michael Page, Joanna Bryson, Roman Yampolskiy, Dario Amodei Machine Learning for Combinatorial Optimization: a Methodological Tour d’Horizon — Yoshua Bengio, Andrea Lodi, Antoine Prouvost 26-Year-Old Nigerian Creates First Gaming Robot — Christina Santi Machine Learning Top 10 Articles for the Past Month (v.Oct 2018) — Mybridge Is artificial intelligence set to become art’s next medium? — Jonathan Bastable, Christie’s An Artificial Neuron Implemented on an Actual Quantum Processor — Tacchino et al. Efficiently measuring a quantum device using machine learning — D.T. Lennon, H. Moon, L.C. Camenzind, Liuqi Yu, D.M. Zumbühl, G.A.D. Briggs, M.A. Osborne, E.A. Laird, N. Ares Deep Learning : Current Limits and What Lies Beyond Them — François Chollet Poker | Solving Imperfect-Information Games via Discounted Regret Minimization — Noam Brown, Tuomas Sandholm TensorFlow code and pre-trained models for BERT (Bidirectional Encoder Representations from Transformers) — Jacob Devlin, Ming-Wei Chang, Kenton Lee, Kristina Toutanova The Superintelligent Will: Motivation and Instrumental Rationality in Advanced Artificial Agents — Nick Bostrom MobiLimb: Augmenting Mobile Devices with a Robotic Limb — Marc Teyssier, Gilles Bailly, Catherine Pelachaud, Eric Lecolinet 32-Legged Spherical Robot Moves Like an Amoeba — Evan Ackerman, IEEE Spectrum On winning all the big academic recent competitions. Presentation. — Megvii (Face++) Team Stanford AI recreates chemistry’s periodic table of elements — Ker Than Neural Approaches to Conversational AI — Jianfeng Gao, Michel Galley, Lihong Li Learned optimizers that outperform SGD on wall-clock and validation loss — Luke Metz, Niru Maheswaranathan, Jeremy Nixon, C. Daniel Freeman, Jascha Sohl-Dickstein Beauty and the Beast: Optimal Methods Meet Learning for Drone Racing — Elia Kaufmann, Mathias Gehrig, Philipp Foehn, René Ranftl, Alexey Dosovitskiy, Vladlen Koltun, Davide Scaramuzza Writing Code for NLP Research — Allen Institute for Artificial Intelligence Autonomous Tidying-up Robot System — Preferred Networks Emerging Technology and Ethics Research Guide – v 1.0 — Danya Glabau Machine learning and artificial intelligence in the quantum domain — Vedran Dunjko, Hans J. Briegel Playing Mortal Kombat with TensorFlow.js. Transfer learning and data augmentation — Minko Gechev A series on quantum computing? Welcome to QuantumCasts! — Marissa Giustina NLP.js : a general natural language utilities for nodejs — AXA Shared Services Spain S.A. Hierarchical Multi-Task Learning model: One NLP model to rule them all! Medium | Demo | Code — Hugging Face Constructing exact representations of quantum many-body systems with deep neural networks — Giuseppe Carleo Over 200 of the Best Machine Learning, NLP, and Python Tutorials — 2018 Edition — Robbie Allen Deep Learning Papers Reading Roadmap — Flood Sung Open Courses and Textbooks — Samuel G. Finlayson ~250 awesome short lectures on robotics — Queensland University of Technology Robot Academy The Best Textbooks on Every Subject — lukeprog “ML paper writing pro-tip: you can download the raw source of any arxiv paper. Click on the “Other formats” link, then click “Download source”. This gets you a .tar.gz with all the .tex files, all the image files for the figures in their original resolution, etc.“ — Ian Goodfellow Montréal.AI Academy : AI 101AI 101 : A Well-Crafted Actionable 75 Minutes Tutorial. The First Comprehensive Overview of All (全) AI for the General Public ＊You are qualified for a career in machine learning! Andrew NgI want to pursue machine learning as a career but not sure if I am qualified... POWERFUL &amp; USEFUL. This actionable tutorial is designed to entrust everybody with the mindset, the skills and the tools to see artificial intelligence from an empowering new vantage point by : — Exalting state of the art discoveries and science ;— Curating the best open-source codes &amp; implementations ; and— Embodying the impetus that drives today’s artificial intelligence. “In life, you need forcing functions. You never know what you’re capable of until you have no choice but go and do it. Excessive comfort leads to unrealized potential.“ — François Chollet Powered by Eventbrite Group Reservation : ✉️ Email Us : info@montreal.ai📞 Phone : +1.514.829.8269🌐 Website : http://www.montreal.ai📝 LinkedIn : https://www.linkedin.com/in/montrealai🏛 Headquarters : 350, PRINCE-ARTHUR STREET W., SUITE #2105, MONTREAL [QC], CANADA, H2X 3R4 *Administrative Head Office #AIFirst #MontrealAI #MontrealAIAcademy #MontrealArtificialIntelligence","link":"/MontrealAI.github.io/academy/index.html"},{"title":"MONTRÉAL.AI | Montréal Artificial Intelligence","text":"MONTRÉAL.AI SPACEA New Era of Superhuman Scientific Discoveries. “My goal is simple. It is a complete understanding of the universe, why it is as it is and why it exists at all.“ — Stephen Hawking A Legendary History | How It All Began — Learn the source of an exceptional legacy : Vincent Boucher | … un cerveau de l’aérospatial! — Le journal de Montreal Shooting Stars | Vincent Boucher — The Canadian Space Agency Employee Newsletter Vincent Boucher | Un (jeune) homme d’exception — Nathalie Petrowski, La Presse Montréal.AI Space : Premium VisionAI + Aerospace | Physics | Robotics Premium Vision : To be the keystone of the AI Space industry. “Recognizing that Montreal is a world-class aerospace industry hub and a world leader in artificial intelligence, we’ve created Montréal.AI Space.“ — Vincent Boucher, B. Sc. Physics, M. A. Policy Analysis and M. Sc. Aerospace Engineering (Space Technology), Founding Chairman at Montréal.AI Montréal.AI Space has a Jewel status in the Montréal.AI Portfolio. “What I cannot create, I do not understand.“ — Richard Feynman Montréal.AI Space : Solving Humanity’s Toughest ChallengesWe are at the verge of a global technological shift. Montréal.AI Space leverages aerospace engineering, applied artificial intelligence and space science researches for use in spaceflight, satellites, and space exploration on an unprecedented scale. A new powerful model for a large number of emerging superintelligence giants spreading across a landscape. “Any Sufficiently Advanced Technology is Indistinguishable from Magic.“ — Arthur C. Clarke Montréal.AI Space : Exploring the Stars and the UniverseWe are living in a period of unprecedented breakthroughs in science. Near future advances at the intersection of aerospace engineering and artificial intelligence hold out extraordinary prospects for the future of Mankind. “Artificial Intelligence is about recognising patterns, Artificial Life is about creating patterns.“ — Mizuki Oka et al, #alife2018 Montréal.AI Space believes in enhancing Humanity’s well-being by leveraging superintelligence to explore the Stars : The place where we truly belong. With higher ingenuity, we implements world‐class agents to design breakthrough deep learning algorithms with an understanding of our Universe. “I think transfer learning is the key to general intelligence. And I think the key to doing transfer learning will be the acquisition of conceptual knowledge that is abstracted away from perceptual details of where you learned it from.“ — Demis Hassabis Montréal.AI’s superhuman AI agents can learn from experience, simulate worlds and orchestrate meta-solutions. Montréal.AI Space is offering a new world age of impactful technical prowesses on a truly global scale. “Of course, particle physicists are among the first to realize that nature is compositional.“ — Yann LeCun References Why does deep and cheap learning work so well? — Henry W. Lin, Max Tegmark, David Rolnick Introduction to astroML: Machine Learning for Astrophysics — Jacob VanderPlas, Andrew J. Connolly, Zˇeljko Ivezic ́, Alex Gray CosmoFlow: Using Deep Learning to Learn the Universe at Scale — Mathuriya et al. Bayesian Deep Learning for Exoplanet Atmospheric Retrieval — Frank Soboczenski, Michael D. Himes, Molly D. O’Beirne, Simone Zorzan, Atilim Gunes Baydin, Adam D. Cobb, Daniel Angerhausen, Giada N. Arney, Shawn D. Domagal-Goldman Galaxy morphology prediction using capsule networks — Katebi et al. Machine Learning for Physics and the Physics of Learning — Steve Brunton, Cecilia Clementi, Yann LeCun, Marina Meila, Frank Noe, Francesco Paesani MINERVA-II1: Successful image capture, landing on Ryugu and hop! — JAXA | Japan Aerospace Exploration Agency Restricted Boltzmann Machines for Collaborative Filtering — Ruslan Salakhutdinov, Andriy Mnih, Geoffrey Hinton A Practical Guide to Training Restricted Boltzmann Machines — Geoffrey Hinton GAIA DATA RELEASE 1 — European Space Agency Evolved Virtual Creatures, Evolution Simulation, 1994 — Karl Sims PHYSICS | MACHINE LEARNING - Recent papers combining the fields of physics and machine learning — physicsml AI Model Could Help Robots Navigate on the Moon and Mars Without GPS — NVIDIA Machine Learning and Likelihood-Free Inference in Particle Physics Slides | Video — Kyle Cranmer Enabling Dark Energy Science with Deep Generative Models of Galaxy Images — Siamak Ravanbakhsh, Francois Lanusse, Rachel Mandelbaum, Jeff Schneider, Barnabas Poczos Unity and DeepMind to Advance AI Research Using Virtual Worlds — Business Wire A look at deep learning for science — Prabhat Searching for Exotic Particles in High-Energy Physics with Deep Learning — Pierre Baldi, Peter Sadowski, Daniel Whiteson Estimating Cosmological Parameters from the Dark Matter Distribution — Siamak Ravanbakhsh, Junier Oliva, Sebastien Fromenteau, Layne C. Price, Shirley Ho, Jeff Schneider, Barnabas Poczos “GET ON A ROCKET SHIP” : Join Montréal.AI Space!Bringing contributions by scholars recognized as the foremost authorities in their fields, Montréal.AI Space is ahead of a trend that will profoundly influence the future of Humanity. Montréal.AI Space is looking for successful Associates &amp; Partners : Captains of Industries, Philanthropists, Iconic Tech Entrepreneurs, Financiers and World-Class Scholars to join us in this task of historic proportions. ✉️ Email Us : info@montreal.ai📞 Phone : +1.514.829.8269🌐 Website : http://www.montreal.ai📝 LinkedIn : https://www.linkedin.com/in/montrealai🏛 Headquarters : 350, PRINCE-ARTHUR STREET W., SUITE #2105, MONTREAL [QC], CANADA, H2X 3R4 *Executive Council and Administrative Head Office #AIFirst #MontrealAI #MontrealAISpace #MontrealArtificialIntelligence","link":"/MontrealAI.github.io/space/index.html"},{"title":"MONTRÉAL.AI | Montréal Artificial Intelligence","text":"MONTRÉAL.AI FINE ARTS (Pre-Release Early Version)Creating Fine AI Arts History | Quintessential Launches in Major Cities! Quebec, Montreal, Vancouver, San Maarten, Beverly Hills, Caesar’s, Panama, Brasil, Paris, Milano, Principauté de Monaco, Geneva, Belgium, Germany, Luxembourg, Spain, Austria, London, Russian Federation, Aspen, Maui, SoHo, Israel, La Jolla, Macau, Dubai, India, Qatar, Saudi Arabia, Beijing, Shanghai, Hong Kong, Tokyo Midtown and Tapei. Pioneering Legendary Fine AI Arts — Montréal.AI is Presenting a New World Age of Artistic Visions. “The Artists Creating with AI Won’t Follow Trends; THEY WILL SET THEM.“ — Montréal.AI Fine Arts A blending of Art, Culture, and Science in the spirit of Leonardo da Vinci. Opening the doors to the AI art movement of the 21st Century, Montréal.AI Fine Arts is causing a huge stir amongst top art collectors and the most brilliant, influential, and iconoclastic figures worldwide. During the Renaissance, Pope Julius II commissioned painter Michelangelo for artwork of the Sistine Chapel ceiling at the Vatican. Today, you may commission AI artwork from The House of Montréal.AI Fine Arts. Captivating a discerning audience, Montréal.AI Fine Arts reflects the aesthetic diversity, conceptual richness and ‘purist’ form of AI creativity expressed by the machine and is regarded as the highest in the hierarchy of genres. We are preparing a worldwide PR campaing with major talk show appearances and a TV documentary. A New Day Has Come in Art IndustryFine AI Art-market history was made on October 25, 2018 when the first artificial intelligence artwork ever sold at Christie’s auction house shattered expectations, fetching $432,500. References The first AI artwork to be sold in a major auction achieves $432,500 after a bidding battle on the phones and via ChristiesLive — Christie’s A sign of things to come? AI-produced artwork sells for $433K, smashing expectations — Allyssia Alleyne, CNN Eerie AI-generated portrait fetches $432,500 at auction — Devin Coldewey, TechCrunch “A spokesperson from Christie’s told us of the market’s excitement as this significant shift. “We can confirm there were 5 different bidders from all parts of the world competing for this lot at that high price level, which seems a good indication of collector interest and future market potential for AI art generally…”“ — Adam Heardman, MutualArt The House of Montréal.AI Fine ArtsFine AI Arts History &amp; Heritage: The Building of a Legacy Montréal.AI Fine Arts is ahead of a trend that will profoundly impact the $350 billion / Year international fashion, fine arts &amp; jewelry industry ( 🌐 http://www.billionaire.tv/TheGazette.pdf ). A Renewal of the High Renaissance Ideals. | Montréal.AI Fine Arts artificial intelligence agents learn from experience to create superhuman artworks and artistic visions! Our creations are pure object of désirs, fairytale lands and enchanted dreams conveying a feeling of exclusiveness : A fascinating, provocative and vibrant AI poetry. Harnessing the Deep Learning, Deep Reinforcement Learning, Generative Adversarial Nets, Meta-Learning and Self-Play on a truly global scale and deploying a passion offering insight with unusual breadth of elegance, refinement and style, The House of Montréal.AI Fine Arts pioneers unmistakable AI-generated superhuman creations and revolutionary designs, unveiling a majestic world of hidden secrets: ❖ The Scent of AI (Perfumes)A line as enchanting as the muses it inspires. ❖ Many-Worlds AI High Jewelry ( 💎 )AI is poised to define the diamond industry of the 21st century.The House of Montreal.AI Fine Arts is pioneering AI Diamond cuts with an unprecedented culmination of brilliance, scintillation and dispersion for the Fashionees who will set the high jewelry trends of our era. ❖ AI Artworks (Signed: Montreal.AI)Numbered and signed original prints including certificate of authenticity. An odyssey of cosmological, divine and mythological parallel universes of AI lullabies. A Legendary History: The Source of an Exceptional LegacyFrom: The General Secretariat of the Montréal.AI Fine Arts Executive Council A professional skilled catalyst versed in innovative research, high financial engineering and international luxury scene, Montreal.AI’s Founding Chairman Vincent Boucher received, on the 15th of October 2009, the prestigious Guinness World Records title for his Largest Cut Paraiba Tourmaline. A Work of Intellectual, Aesthetic and Technical Innovation | Vincent Boucher’s strategic foresight and ability to drive one of the most ambitious projects in History has pushed this highly experienced and seasoned human being to the forefront of its field, earning a well-deserved reputation on a truly global scale. “Financier (Vincent Boucher) acquires world’s rarest stone.”“ — Mike King, The Gazette Exalting the purest and most beautiful creations, offering education and research revealing a unique range of critical, intellectual, and historical point of view, and opening the doors to a New Art Movement, The House of Montréal.AI Fine Arts fuels, with authority, the passion that drive today’s most successful AI artists. Defining the Genre of AI-Made Fine ArtA Sense of Mystery… And Deep Understanding of the World, People and Human Nature. “To identify truly path-breaking work, we would do better to stop asking where the boundary line lies between human artists’ agency and that of AI toolsets, and instead start asking whether human artists are using AI to plumb greater conceptual and aesthetic depths than researchers or coders.“ — Tim Schneider and Naomi Rea, artnet, September 25, 2018 Deep Learning + Deep Reinforcement Learning + Generative Adversarial Nets + Meta-Learning + Self-Play References Data Science, Machine Learning and Artificial Intelligence for Art — Vishal Kumar Scaling the Mission: The Met Collection API (406,000 images of over 205,000 CC0 objects) — Loic Tallon, Chief Digital Officer What do 50 million drawings look like? — Google Neural scene rendering: Transfer learning to render a fruit still life from photos — Brett Göhre GAN Lab: Play with Generative Adversarial Networks (GANs) in your browser! Web | Paper — Minsuk Kahng, Nikhil Thorat, Polo Chau, Fernanda Viégas, and Martin Wattenberg Generating Memoji from Photos — Pat Niemeyer Playing a game of GANstruction — Helena Sarin Large Scale GAN Training for High Fidelity Natural Image Synthesis Paper | TF Hub | Colab — Andrew Brock, Jeff Donahue, Karen Simonyan TL-GAN: transparent latent-space GAN — SummitKwan TensorFlow-GAN (TFGAN) — Joel Shor, Sergio Guadarrama Progressive GANs | Notebook with smooth interpolations through z-space — Gene Kogan Self-Attention GAN Paper | Tensorflow implementation — Han Zhang, Ian Goodfellow, Dimitris Metaxas, Augustus Odena Discriminator Rejection Sampling — Samaneh Azadi, Catherine Olsson, Trevor Darrell, Ian Goodfellow, Augustus Odena Tensorpack | Generative Adversarial Networks — Tensorpack Ngx | Neural network based visual generator and mixer — Keijiro Takahashi Magenta Studio (beta) — Google AI Differentiable Monte Carlo Ray Tracing through Edge Sampling — Tzu-Mao Li, Miika Aittala, Frédo Durand, Jaakko Lehtinen A Few Unusual Autoencoders — Colin Raffel Deep Variational Reinforcement Learning for POMDPs — Maximilian Igl, Luisa Zintgraf, Tuan Anh Le, Frank Wood, Shimon Whiteson Learning Dexterity — OpenAI Robots that Learn — OpenAI (Self-Play) | OpenAI Five — OpenAI TFHub state-of-the-art AutoAugment Modules — TensorFlow Creatability: a new collection of experiments exploring ways to make creative tools more accessible — Experiments with Google Evolved Virtual Creatures, Evolution Simulation, 1994 — Karl Sims Reinforcement Learning for Improving Agent Design: What happens when we let an agent learn a better body design together with learning its task? Article | Paper — David Ha “The defining art-making technology of our era will be AI.“ — Rama Allen #AI4Artists : Unveilling a World of Hidden SecretsPioneering Legendary Creations : A Well-Crafted 75 Minutes Tutorial for Artists Who do you turn to if you seek out to learn the very best in AI for Artists? Encompassing all facets of AI for Artists, the General Secretariat of MONTREAL.AI introduces, with authority and insider knowledge: “#AI4Artists: First World-Class Overview of AI for Artists“. POWERFUL &amp; USEFUL. This actionable tutorial is designed to entrust every person who creates art with the mindset, the skills and the tools to see artificial intelligence from an empowering new vantage point by : — Exalting state of the art discoveries and science ;— Curating the best open-source codes &amp; implementations ; and— Embodying the impetus that drives today’s artificial intelligence. Designed for artists, #AI4Artists is created to inspire artists who, with AI, will shape the 21st Century. Powered by Eventbrite A Truly Special Celebration that is Certain to Make History!For Andre Breton, the father of surrealism, the purpose of Art is the unification of the real and the imaginary. Montréal.AI Fine Arts makes Breton’s dream come true. A truly special celebration in the world of fine arts, fashion and high jewelry and one that is certain to make history! We are looking for Ambassadors &amp; Partners. ✉️ Email Us : info@montreal.ai📞 Phone : +1.514.829.8269🌐 Website : http://www.montreal.ai📝 LinkedIn : https://www.linkedin.com/in/montrealai🏛 Headquarters : 350, PRINCE-ARTHUR STREET W., SUITE #2105, MONTREAL [QC], CANADA, H2X 3R4 *Executive Council and Administrative Head Office #AIFirst #MontrealAI #MontrealAIArt #MontrealArtificialIntelligence","link":"/MontrealAI.github.io/art/index.html"}],"posts":[{"title":"Montréal Artificial Intelligence","text":"MONTRÉAL.AI | Montréal Artificial Intelligence Montréal.AI Joint Transformative AI Engineering Task ForceMONTRÉAL.AI (EST’B’D 2003) | Montréal Artificial Intelligence, a research company at the forefront of the AI field, is developing and commercializing the most significant technology ever created by humans. We harness the fundamentals of artificial intelligence on a truly global scale and put them to strategically leverage enterprises, governments and institutions with precision engineering. The Montréal.AI’s Joint Transformative AI Engineering Task Force, operating unilaterally or in combination with multinational and interagency partners, is accountable for the pre-eminent deployment and orchestration of the Montréal AI-First Conglomerate Overarching Program in order to powerfully scale AI to global industrial landscapes, to pioneer AI-first systemic business advantages and to win the AI race. 🌐 http://montreal.ai/taskforce.pdf Montréal AI-First Conglomerate : A Win-Win ApproachUnder Montréal.AI’s umbrella, multiple companies and organisation are being structured to apply hugely impactful AI technologies in ways never thought of and to launch emerging superintelligence giants startups : ❖ Montréal.AI AcademyTraining the individuals who, with AI, will shape the 21st Century. ❖ Montréal.AI Fine ArtsPioneering legendary fine AI arts opening the doors to the AI art movement. ❖ Montréal.AI ConsultingConsulting the right AI leader can significantly increase your odds of business success. ❖ Montréal.AI SpaceEnhancing Humanity’s well-being by leveraging superintelligence to explore the Stars. ❖ Montréal.AI WebDeploying artificial intelligence and ML models on the World Wide Web (WWW). General Secretariat Of Montreal.AIWho do you turn to if you seek out the very best in Artificial Intelligence? Encompassing all facets of AI, the General Secretariat Of Montreal.AI introduces, with authority, the first world-class AI concierge services. Our little black book holds the connections, insider knowledge and numbers to help you out – no matter what the request… Invitation-only | $25,000 membership fee. A High-Stakes Game“Successful business strategy is about actively shaping the game you play, not just playing the game you find“ — The Right Game: Use Game Theory to Shape Strategy | A. Brandenburger &amp; B. Nalebuff Montréal Artificial Intelligence adopts a new tradition of responsibility to create win-win situations. By focusing on the others players we develop cooperative opportunities within the wider perspective of society. Our Montréal.AI Academy inspires, supports and trains the individuals who, with artificial intelligence, will shape the Arts, the Sciences and the Humanities of the 21st Century to create a sustainable future. We are at the verge of a global technological shift. Drawing on extensive experience, Montréal.AI is starting an effort reaching out to Captains of Industry, Iconic Tech Entrepreneurs, Luminaries, Philanthropists, Scholars and Successful Financiers to join us at boardroom level in this task of historic proportions. What is your AI strategy? ✉️ Email Us : info@montreal.ai📞 Phone : +1.514.829.8269🌐 Website : http://www.montreal.ai/📝 LinkedIn : https://www.linkedin.com/in/montrealai/🏛 Headquarters : 350, PRINCE-ARTHUR STREET W., SUITE #2105, MONTREAL [QC], CANADA, H2X 3R4 *Administrative Head Office #AIFirst #MontrealAI #MontrealArtificialIntelligence","link":"/MontrealAI.github.io/2018/06/27/index/"}],"tags":[],"categories":[]}